# Chapter 3
### The R environment

Which we will, of course, be going through in Python!

In [6]:
import pandas as pd

Parts 3.1 to 3.4: R setup, installing packages, etc.

3.5 : Creating variables

In [10]:
metallica_names = ['Lars', 'James', 'Kirk', 'Rob']
metallica_names

['Lars', 'James', 'Kirk', 'Rob']

In [11]:
metallica_ages = [47, 47, 48, 46]
metallica_ages

[47, 47, 48, 46]

Though, of course, a better data structure would be a dictionary in this case. Let's use it to create our df:

In [15]:
metallica_df = pd.DataFrame({
    'Name': metallica_names,
    'Age': metallica_ages
})
metallica_df

    Name  Age
0   Lars   47
1  James   47
2   Kirk   48
3    Rob   46

In [16]:
metallica_df['Name']

0     Lars
1    James
2     Kirk
3      Rob
Name: Name, dtype: object

In [18]:
metallica_df.descri

'    Name  Age\n0   Lars   47\n1  James   47\n2   Kirk   48\n3    Rob   46'

In [7]:
DATA_URLS = {
    'Lecturer Data': 'https://studysites.uk.sagepub.com/dsur/study/DSUR%20Data%20Files/Chapter%203/Lecturer%20Data.dat'
}

df_lecturer_data = pd.read_csv(DATA_URLS['Lecturer Data'], sep='\t')

In [8]:
df_lecturer_data.head()

     name  birth_date  job  friends  alcohol  income  neurotic
0     Ben    7/3/1977    1        5       10   20000        10
1  Martin   5/24/1969    1        2       15   40000        17
2    Andy   6/21/1973    1        0       20   35000        14
3    Paul   7/16/1970    1        4        5   22000        13
4  Graham  10/10/1949    1        1       30   50000        21